package com.ad.adinfo.Service;

import com.ad.adinfo.Domain.AD_USER_MASTER;
import com.ad.adinfo.Mapper.AdUserMaster;
import com.ad.adinfo.Mapper.CpaCampaignData;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.stereotype.Service;

import java.util.List;

@Service
public class AdInfoUtil {

    @Autowired
    AdUserMaster adUserMaster;

    @Autowired
    CpaCampaignData cpaCampaignData;

    /*------------------------------------------------------------------------------------------------------------------
     * 로그인 아이디로 광고주ID를 조회한다.
     *------------------------------------------------------------------------------------------------------------------
     * 작성일 : 2021.07.16
     * 작성자 : 박형준
     *------------------------------------------------------------------------------------------------------------------
     * 테이블 : [C]
     *         [R] COMMON_CODE
     *         [U]
     *         [D]
     *------------------------------------------------------------------------------------------------------------------
     * 코멘트 : 없음.
     -----------------------------------------------------------------------------------------------------------------*/
    public Long AdClntIdToAdId(String adClntId) {
        List<AD_USER_MASTER> adUserMasterSql;
        adUserMasterSql = adUserMaster.getAdUserMaster(adClntId);
        return adUserMasterSql.get(0).getAdAdId();
    }

    /*------------------------------------------------------------------------------------------------------------------
     * 로그인 아이디로 파트너ID를 조회한다.
     *------------------------------------------------------------------------------------------------------------------
     * 작성일 : 2021.07.16
     * 작성자 : 박형준
     *------------------------------------------------------------------------------------------------------------------
     * 테이블 : [C]
     *         [R] COMMON_CODE
     *         [U]
     *         [D]
     *------------------------------------------------------------------------------------------------------------------
     * 코멘트 : 없음.
     -----------------------------------------------------------------------------------------------------------------*/
    public Long AdClntIdToPtId(String adClntId) {
        List<AD_USER_MASTER> adUserMasterSql;
        adUserMasterSql = adUserMaster.getAdUserMaster(adClntId);
        return adUserMasterSql.get(0).getAdPtId();
    }

    /*------------------------------------------------------------------------------------------------------------------
     * 파트너별 당일 접수된 DB 합계
     *------------------------------------------------------------------------------------------------------------------
     * 작성일 : 2021.07.16
     * 작성자 : 박형준
     *------------------------------------------------------------------------------------------------------------------
     * 테이블 : [C]
     *         [R] CPA_CAMPAIGN_DATA
     *         [U]
     *         [D]
     *------------------------------------------------------------------------------------------------------------------
     * 코멘트 : 없음. getCpaCampaignDataTodayInCount
     -----------------------------------------------------------------------------------------------------------------*/
    public Long GetCpaCampaignDataDateInCount(Long ptId, String date) {
        return cpaCampaignData.getCpaCampaignDataTodayInCount(ptId, date);
    }

    /*------------------------------------------------------------------------------------------------------------------
     * 로그인정보를 확인한다.
     *------------------------------------------------------------------------------------------------------------------
     * 작성일 : 2021.07.16
     * 작성자 : 박형준
     *------------------------------------------------------------------------------------------------------------------
     * 테이블 : [C]
     *         [R] CPA_CAMPAIGN_DATA
     *         [U]
     *         [D]
     *------------------------------------------------------------------------------------------------------------------
     * 코멘트 : 없음. getCpaCampaignDataTodayInCount
     -----------------------------------------------------------------------------------------------------------------*/
//    public Long GetCpaCampaignDataDateInCount(Long ptId, String date) {
//        return cpaCampaignData.getCpaCampaignDataTodayInCount(ptId, date);
//    }



}